Reports/усд_ЛистСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>усд_ЛистСогласования</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/усд_ДвижениеДокументовПоМаршрутам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>усд_ДвижениеДокументовПоМаршрутам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_МаршрутыДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвращенНаЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.усд_СтатусыДокументовНаЭтапах</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.усд_ПриоритетыРассмотренияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаВозврата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.усд_ЕдиницыИзмеренияВремениИсполненияЗадачСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольСроковИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/усд_ЛистСогласования/Ext/ObjectModule.bsl
Перем ЗаполнениеПараметров Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем ДанныеРасшифровки Экспорт;

// Получить параметры исполнения отчета
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеКомпоновкиМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки",
							Ложь, Ложь, Истина, Ложь);
							
КонецФункции

// После вывода результата
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	Макет 			= ПолучитьМакет("Макет");
	Область 		= Макет.ПолучитьОбласть("Заголовок");
//	ВысотаОбласти 	= Макет.ВысотаТаблицы;

	ЗаполнитьПараметрыОбласти(Область,ПараметрыОтчета.Документ);

	Результат.ВставитьОбласть(Область,Результат.Область("R1"),ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

Процедура Скомпоновать(ДокументРезультат) Экспорт
	СкомпоноватьРезультат(ДокументРезультат,ДанныеРасшифровки);	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Документ = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Документ").Значение;
	Макет = ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	ЗаполнитьПараметрыОбласти(Область,Документ);
	
	ДокументРезультат.Вывести(Область);

КонецПроцедуры

Процедура ЗаполнитьПараметрыОбласти(Область,Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Период,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Документ,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ОтветственноеЛицо,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Этап,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Маршрут,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ВидДокументов,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ВозвращенНаЭтап,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Статус,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Приоритет,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ПричинаВозврата
		|ИЗ
		|	РегистрСведений.усд_ДвижениеДокументовПоМаршрутам.СрезПоследних(, Документ = &Документ) КАК усд_ДвижениеДокументовПоМаршрутамСрезПоследних";

	Запрос.УстановитьПараметр("Документ", Документ);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Область.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
	КонецЕсли;
КонецПроцедуры

ЗаполнениеПараметров = Новый Структура;
